Revit 2027 API
JournalingMode Enumeration
 All journaling modes supported by Revit external commands.
Namespace: Autodesk.Revit.Attributes
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum JournalingMode
Public Enumeration JournalingMode
public enum class JournalingMode
type JournalingMode
Members
Member name | Value | Description
NoCommandData | 1 |  Does not write contents of the ExternalCommandData.Data map to the Revit journal. But does allow Revit API calls to write to the journal as needed. This option should allow commands which invoke the Revit UI for selection or for responses to task dialogs to replay correctly.
UsingCommandData | 0 |  Uses the "StringStringMap" supplied in the command data. Hides all Revit journal entries in between the external command invocation and the StringStringMap entry. Commands which invoke the Revit UI for selection or for responses to task dialogs may not replay correctly.
See Also
Reference
Autodesk.Revit.Attributes Namespace